---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInMainModelWarn
source: html/65689b24-233e-6e19-ba02-841df55921bf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInMainModelWarn Property

A sweep in a design option cannot be hosted by an element in the Main Model [--if you continue it will not be added to the design option set].

## Syntax (C#)
```csharp
public static FailureDefinitionId ConfusingSweepByElementsInMainModelWarn { get; }
```